<template>
    <div>
        <div class="bg">
            <div class="cards">
                <center class="cent">
                    <h1 class="h11"><span> Порядок работы </span>при ремонте<br>
                        компьютероной техники</h1>
                </center>
            </div>
            <div class="kta">
                <div class="cs">
                    <div class="card">
                        <img src="./image/phone-ringing-dynamic-color.png" alt="">
                        <h3 class="h03">Ваша заявка на сайте
                            или по телефону</h3>
                        <p class="p02">С вами по телефону согласовывают
                            дату и время выезда специалиста</p>
                        <p class="p01">1 шаг</p>
                    </div>
                    <div class="card">
                        <img src="./image/phone-ringing-dynamic-color.png" alt="">
                        <h3 class="h03">Ваша заявка на сайте
                            или по телефону</h3>
                        <p class="p02">С вами по телефону согласовывают
                            дату и время выезда специалиста</p>
                        <p class="p01">1 шаг</p>
                    </div>
                </div>
                <div class="ss">
                    <div class="card">
                        <img src="./image/phone-ringing-dynamic-color.png" alt="">
                        <h3 class="h03">Ваша заявка на сайте
                            или по телефону</h3>
                        <p class="p02">С вами по телефону согласовывают
                            дату и время выезда специалиста</p>
                        <p class="p01">2 шаг</p>
                    </div>
                    <div class="card">
                        <img src="./image/phone-ringing-dynamic-color.png" alt="">
                        <h3 class="h03">Ваша заявка на сайте
                            или по телефону</h3>
                        <p class="p02">С вами по телефону согласовывают
                            дату и время выезда специалиста</p>
                        <p class="p01">2 шаг</p>
                    </div>
                </div>
            </div>
            <center>
                <div class="mini">
                    <p>Оставьте заявку на сайте и наш менеджер<br>
                        сразу же с Вами свяжется!</p>
                    <div class="dum">Оставить
                        заявку</div>
                </div>
            </center>
            <div class="mnca">

                <div class="orta-kicj">
                    <center>
                        <h1 class="asd">Наши мастера и курьеры<br>
                            всегда готовы <span class="spn1"> приехать на помощь</span></h1>
                        <p class="pp1">Вызовите мастера или курьера в любой<br>
                            район Санкт-Петербурга</p>
                    </center>
                    <div class="kicik">
                        <div class="kam">
                            <img src="./image/IMG_5730.png" alt="">
                        </div>
                        <div class="kam">
                            <img src="./image/Frame 596.png" alt="">
                        </div>
                        <div class="kam">
                            <img src="./image/IMG_5729 2.png" alt="">
                        </div>
                        <div class="kam">
                            <img src="./image/IMG_5734.png" alt="">
                        </div>
                        <div class="kam">
                            <img src="./image/изображение 1.png" alt="">
                        </div>
                    </div>
                    <div class="kicik2">
                        <div class="kam">
                            <img src="./image/IMG_5735.png" alt="">
                        </div>
                        <div class="kam">
                            <img src="./image/IMG_5737.png" alt="">
                        </div>
                        <div class="kam">
                            <img src="./image/IMG_5731.png" alt="">
                        </div>
                    </div>
                    <center><button class="clci">Вызвать мастера на дом</button></center>
                </div>

                <div class="maxx">
                    <div class="mini01">
                        <img src="./image/free-icon-quote-565703 1 (Traced).png" alt="">
                        <p class="p6">Все работы, которые мы выполняем, требуют неограниченного доступа персонала компании к
                            современному оборудованию и инструменту, что не является проблемой, поскольку ремонтная база мастерской безупречно оснащена. Кроме того, в распоряжении сотрудников сервис-центра имеется небольшой склад оригинальных запчастей, благодаря которому удается существенно сократить время починки компьютера. Наши специалисты постоянно повышают собственную квалификацию и накапливают полезные знания и опыт в сфере ремонта компьютерной техники</p>
                    </div>
                    <div class="halilov">
                        <center>
                            <h1 class="bole">Более 200 отзывов <br>
                                от <span> реальных клиентов</span></h1>
                        </center>
                    </div>

                    <swiper style="width:70%;margin:auto" :slidesPerView="2" :spaceBetween="0" :loop="true" :pagination="{
                        clickable: true,
                    }" :navigation="true" :modules="modules" class="mySwiper0">
                        <swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                        <swiper-slide>
                            <div class="mgi2">
                                <h3 class="aass"><i class='bx bxl-google'></i> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основносказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                        <swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                        <swiper-slide>
                            <div class="mgi2">
                                <h3 class="aass"><i class='bx bxl-google'></i> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основносказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide><swiper-slide>

                            <div class="mgi2">
                                <h3 class="aass"><i class='bx bxl-google'></i> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основносказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                        <swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                        <swiper-slide>
                            <div class="mgi2">
                                <h3 class="aass"><i class='bx bxl-google'></i> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основносказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                        <swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide><swiper-slide>

                            <div class="mgi2">
                                <h3 class="aass"><i class='bx bxl-google'></i> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основносказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                    </swiper>
                    <swiper :pagination="{
                        type: 'progressbar',
                    }" :navigation="true" :modules="modules" class="mySwiper2">
                        <swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                        <swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide><swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                        <swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide><swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                        <swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide><swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                        <swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide><swiper-slide>
                            <div class="mgi">
                                <h3><i class='bx bxl-google'></i>
                                    <p class="p001">|</p> Егор Панов
                                </h3><br>
                                <p class="otl">Отличный сервисный центр! Взялись за
                                    работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                    По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                    Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                    Спасибо огромное ребятам за качественный ремонт!
                                    Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                            </div>
                        </swiper-slide>
                    </swiper>

                    <center class="pasd">
                        <p class="pro">Прочитайте отзывы на сторонних ресурсах<br>
                            и убедитесь в качестве нашей работы</p>
                    </center>
                    <div class="iconka">
                        <img src="./image/Frame 31.png" alt="">
                        <img src="./image/Frame 32.png" alt="">
                        <img src="./image/Frame 36.png" alt="">
                        <img src="./image/Frame 35.png" alt="">
                    </div>
                    <div class="cardla">
                        <h1 class="nma"><span>Наши работы</span> по ремонту<br>
                            компьюетрной техники</h1>
                        <div class="btnla">
                            <button>Ноутбуки</button>
                            <button>Моноблоки</button>
                            <button>Компьютеры</button>
                        </div>

                        <div class="phon">
                            <swiper style="width:80%;margin:auto" :slidesPerView="1" :spaceBetween="0" :loop="true" :pagination="{
                                clickable: true,
                            }" 
                            :navigation="true"
                            :breakpoints="{
                                1600: {
                                    slidesPerView: 2
                                },
                            }"                
                            :modules="modules" 
                              class="mySwiper">
                                <swiper-slide>
                                    <div class="abdurahim">
                                        <div class="jadks">
                                            <h1>Ремонт материнской платы различных<br>
                                                брендов и моделей ноутбуков</h1>
                                            <p>Ремонт ноутбуков</p>
                                        </div>
                                    </div>
                                </swiper-slide>
                                <swiper-slide>
                                    <div class="abdurahim">
                                        <div class="jadks">
                                            <h1>Ремонт материнской платы различных<br>
                                                брендов и моделей ноутбуков</h1>
                                            <p>Ремонт ноутбуков</p>
                                        </div>
                                    </div>
                                </swiper-slide>
                                <swiper-slide>
                                    <div class="abdurahim">
                                        <div class="jadks">
                                            <h1>Ремонт материнской платы различных<br>
                                                брендов и моделей ноутбуков</h1>
                                            <p>Ремонт ноутбуков</p>
                                        </div>
                                    </div>
                                </swiper-slide>
                                <swiper-slide>
                                    <div class="abdurahim">
                                        <div class="jadks">
                                            <h1>Ремонт материнской платы различных
                                                брендов и моделей ноутбуков</h1>
                                            <p>Ремонт ноутбуков</p>
                                        </div>
                                    </div>
                                </swiper-slide><swiper-slide>
                                    <div class="abdurahim">
                                        <div class="jadks">
                                            <h1>Ремонт материнской платы различных<br>
                                                брендов и моделей ноутбуков</h1>
                                            <p>Ремонт ноутбуков</p>
                                        </div>
                                    </div>
                                </swiper-slide>
                                <swiper-slide>
                                    <div class="abdurahim">
                                        <div class="jadks">
                                            <h1>Ремонт материнской платы различных<br>
                                                брендов и моделей ноутбуков</h1>
                                            <p>Ремонт ноутбуков</p>
                                        </div>
                                    </div>
                                </swiper-slide>
                                <swiper-slide>
                                    <div class="abdurahim">
                                        <div class="jadks">
                                            <h1>Ремонт материнской платы различных<br>
                                                брендов и моделей ноутбуков</h1>
                                            <p>Ремонт ноутбуков</p>
                                        </div>
                                    </div>
                                </swiper-slide>
                                <swiper-slide>
                                    <div class="abdurahim">
                                        <div class="jadks">
                                            <h1>Ремонт материнской платы различных<br>
                                                брендов и моделей ноутбуков</h1>
                                            <p>Ремонт ноутбуков</p>
                                        </div>
                                    </div>
                                </swiper-slide><swiper-slide>

                                    <div class="abdurahim">
                                        <div class="jadks">
                                            <h1>Ремонт материнскойплаты различных<br>
                                                брендов и моделейноутбуков</h1>
                                            <p>Ремонт ноутбуков</p>
                                        </div>
                                    </div>
                                </swiper-slide>
                            </swiper>
                            <!-- <swiper :slidesPerView="1" :spaceBetween="10" :loop="true" :pagination="{
                                clickable: true,
                            }" :navigation="true" :modules="modules" class="mySwiper3">
                                <swiper-slide>
                                    <div class="cardcami">
                                        <h1>Lorem ipsum dolor sit.</h1>
                                        <p>Lorem, ipsum.</p>
                                    </div>
                                </swiper-slide>
                                <swiper-slide>
                                    <div class="cardcami">
                                        <h1>Lorem ipsum dolor sit.</h1>
                                        <p>Lorem, ipsum.</p>
                                    </div>
                                </swiper-slide><swiper-slide>
                                    <div class="cardcami">
                                        <h1>Lorem ipsum dolor sit.</h1>
                                        <p>Lorem, ipsum.</p>
                                    </div>
                                </swiper-slide>
                                <swiper-slide>
                                    <div class="cardcami">
                                        <h1>Lorem ipsum dolor sit.</h1>
                                        <p>Lorem, ipsum.</p>
                                    </div>
                                </swiper-slide><swiper-slide>
                                    <div class="cardcami">
                                        <h1>Lorem ipsum dolor sit.</h1>
                                        <p>Lorem, ipsum.</p>
                                    </div>
                                </swiper-slide>
                                <swiper-slide>
                                    <div class="cardcami">
                                        <h1>Lorem ipsum dolor sit.</h1>
                                        <p>Lorem, ipsum.</p>
                                    </div>
                                </swiper-slide><swiper-slide>
                                    <div class="cardcami">
                                        <h1>Lorem ipsum dolor sit.</h1>
                                        <p>Lorem, ipsum.</p>
                                    </div>
                                </swiper-slide>
                                <swiper-slide>
                                    <div class="cardcami">
                                        <h1>Lorem ipsum dolor sit.</h1>
                                        <p>Lorem, ipsum.</p>
                                    </div>
                                </swiper-slide><swiper-slide>
                                    <div class="cardcami">
                                        <h1>Lorem ipsum dolor sit.</h1>
                                        <p>Lorem, ipsum.</p>
                                    </div>
                                </swiper-slide>
                            </swiper> -->
                            <div class="mini01">
                                <img src="./image/free-icon-quote-565703 1 (Traced).png" alt="">
                                <p class="p6">Все работы, которые мы выполняем, требуют неограниченного доступа персонала компании к
                                    современному оборудованию и инструменту, что не является проблемой, поскольку ремонтная база мастерской безупречно оснащена. Кроме того, в распоряжении сотрудников сервис-центра имеется небольшой склад оригинальных запчастей, благодаря которому удается существенно сократить время починки компьютера. Наши специалисты постоянно повышают собственную квалификацию и накапливают полезные знания и опыт в сфере ремонта компьютерной техники</p>
                            </div>
                            <div class="latta" style="margin-top: 100px;">
                                <center>
                                    <h1 class="qoch">Вызовите специалиста на дом<br>
                                        <span>Приедем в любой район</span> Санкт-Петербурга
                                    </h1>
                                    <p class="poch" style="margin-top: 30px;">Мы приедем, починим Ваше устройство или заберем
                                        его в сервисный центр для дальнейшего ремонта</p>
                                </center>
                                <div class="bosh">
                                    <div class="kalla2">
                                        <div class="pta">
                                            <img src="./image/Metro_Sankt-Petersburg 9.png" alt="">
                                            <br>
                                            <h4>Красная ветка</h4>
                                            <p>Все станции красной ветки метрополитена <br>
                                                и районы вокруг</p>
                                        </div>
                                        <div class="pta">
                                            <img src="./image/Metro_Sankt-Petersburg 9.png" alt="">
                                            <br>
                                            <h4>Красная ветка</h4>
                                            <p>Все станции красной ветки метрополитена <br>
                                                и районы вокруг</p>
                                        </div>
                                        <div class="pta">
                                            <img src="./image/Metro_Sankt-Petersburg 9.png" alt="">
                                            <br>
                                            <h4>Красная ветка</h4>
                                            <p>Все станции красной ветки метрополитена <br>
                                                и районы вокруг</p>
                                        </div>
                                    </div>
                                    <div class="kalla">
                                        <div class="pta">
                                            <img src="./image/Metro_Sankt-Petersburg 9.png" alt="">
                                            <br>
                                            <h4>Красная ветка</h4>
                                            <p>Все станции красной ветки метрополитена <br>
                                                и районы вокруг</p>
                                        </div>
                                        <div class="pta">
                                            <img src="./image/Metro_Sankt-Petersburg 9.png" alt="">
                                            <br>
                                            <h4>Красная ветка</h4>
                                            <p>Все станции красной ветки метрополитена <br>
                                                и районы вокруг</p>
                                        </div>
                                        <div class="pta">
                                            <img src="../components/image/Metro_Sankt-Petersburg 9.png" alt="">
                                            <br>
                                            <h4>Красная ветка</h4>
                                            <p>Все станции красной ветки метрополитена <br>
                                                и районы вокруг</p>
                                        </div>
                                    </div>
                                    <div class="mini02">

                                    </div>
                                </div>
                            </div>
                            <div class="page-nechi">
                                <center><span class="page-span">Принимаем к оплате</span>
                                    <h1>наличные, карты и переводы</h1>
                                </center>
                                <div class="necicard">
                                    <div class="ant">
                                        <div class="anm">
                                            <h3>Наличный рассчет</h3>
                                            <p>Оплата услуг наличными</p>
                                        </div>
                                        <img src="./image/money-dynamic-color.png" alt="">
                                    </div>
                                    <div class="ant">
                                        <div class="anm">
                                            <h3>Наличный рассчет</h3>
                                            <p>Оплата услуг наличными</p>
                                        </div>
                                        <img src="./image/money-dynamic-color.png" alt="">
                                    </div>
                                    <div class="ant">
                                        <div class="anm">
                                            <h3>Наличный рассчет</h3>
                                            <p>Оплата услуг наличными</p>
                                        </div>
                                        <img src="./image/money-dynamic-color.png" alt="">
                                    </div>
                                </div>
                                <div class="mip">
                                    <img src="./image/Frame 631.png" alt="">
                                </div>
                                <div class="mini01">
                                    <img src="./image/free-icon-quote-565703 1 (Traced).png" alt="">
                                    <p class="p6">Все работы, которые мы выполняем, требуют неограниченного доступа персонала компании к
                                        современному оборудованию и инструменту, что не является проблемой, поскольку ремонтная база мастерской безупречно оснащена. Кроме того, в распоряжении сотрудников сервис-центра имеется небольшой склад оригинальных запчастей, благодаря которому удается существенно сократить время починки компьютера. Наши специалисты постоянно повышают собственную квалификацию и накапливают полезные знания и опыт в сфере ремонта компьютерной техники</p>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>

    <!-- <div class="mxmgi">
                                    <div class="mgi">
                                        <h3><i class='bx bxl-google'></i>
                                            <p class="p001">|</p> Егор Панов
                                        </h3><br>
                                        <p class="otl">Отличный сервисный центр! Взялись за
                                            работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                            По нелепой случайности разбился глазок основной камеры iPhone 12 и соответсвенно пришла в негодность и сама камера.
                                            Вечером сдал - днём следующего дня забрал. Все сделано просто идеально! Со стороны вообще не сказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                            Спасибо огромное ребятам за качественный ремонт!
                                            Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                                    </div>
                                    <div class="mgi2">
                                        <h3 class="aass"><i class='bx bxl-google'></i> Егор Панов
                                        </h3><br>
                                        <p class="otl">Отличный сервисный центр! Взялись за
                                            работу, от которой отказывались в авторизованных сервисных центрах, ссылаясь на неремонтопригодность.
                                            По нелепой случайности разбился глазок основносказать, что с телефоном производились какие-то манипуляции в плане ремонта.
                                            Спасибо огромное ребятам за качественный ремонт!
                                            Хоть и есть сервисные центры ближе к дому, но теперь однозначно буду ездить только сюда!</p>
                                    </div>
                                </div> -->
</template>
<style scoped>
* {
    margin: 0;
    padding: 0;
    box-sizing: border-box;
}

.mip {
    width: 100%;
    margin-top: 80px;
    text-align: center;
}

span {
    background: #4047FF;
    padding-left: 10px;
    padding-right: 3px;
    border-radius: 10px;
}

.cent {
    color: white;
    font-weight: 600;
}

main {
    /*background: #000;*/
}

.bg {
    width: 100%;
    height: 100%;
    /*background: #000;*/
    padding-top: 60px;
}

.card {
    width: 390px;
    background: #fff;
    margin-top: 20px;
    padding-left: 20px;
    border-radius: 20px;
    margin-left: 20px;
}

.card img {
    width: 30%;
}

.p01 {
    margin-top: 100px;
    font-weight: 900;
    padding-bottom: 10px;
    color: #4047FF;
}

.p02 {
    margin-top: 30px;
    width: 90%;
    color: #949490;
}

.h03 {
    margin-top: 10px;
    width: 80%;
    color: black;
}

.cs {
    display: block;
}

.kta {
    display: flex;
    justify-content: center;
    margin-top: 10px;
    flex-wrap: wrap;
    padding-bottom: 20px;
}

.ss {
    margin-top: 30px;
}

.mini {
    width: 70%;
    height: 20%;
    color: white;
    padding-bottom: 30px;
}

.mini p {
    padding-top: 20px;
    font-size: 17px;
    font-weight: 700;
}

.dum {
    width: 100px;
    height: 100px;
    border-radius: 50%;
    padding-top: 30px;
    background: #4047FF;
    color: white;
    margin-top: 10px;
    font-weight: 700;
}

.mnca {
    width: 100%;
    height: 10vh;

    padding-top: 50px;
}

.spn1 {
    color: #4047ff;
    background: none;
}

.pp1 {
    margin-top: 20px;
    font-family: system-ui, -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Open Sans', 'Helvetica Neue', sans-serif;
    color: gray;
}

.asd {
    font-family: Verdana, Geneva, Tahoma, sans-serif;
    font-weight: 900;
}

.orta-kicj {
    width: 100%;
    display: flex;
    align-items: center;
    justify-content: space-around;
    flex-direction: column;
    background: #FFF;
    padding-top: 10px;
    padding-bottom: 10px;

}

.kicik {
    display: flex;
    justify-content: center;
    margin-top: 40px;
    flex-wrap: wrap;
}

.kicik .kam {
    margin-left: 25px;
    margin-top: 10px;
}

.kam img {
    border-radius: 30px;
    box-shadow: 0 0 10px rgba(0, 0, 0, 0.114);
    width: 170px;
}

.kotta {
    width: 100%;
    height: 100vh;
    background: #fff;
}

.kicik2 {
    display: flex;
    justify-content: center;
    margin-top: 30px;
    flex-wrap: wrap;
}

.kicik2 .kam {
    margin-left: 25px;
    margin-top: 20px;
}

.clci {
    width: 230px;
    height: 50px;
    border-radius: 20px;
    border: none;
    background: #4047FF;
    font-size: 13px;
    color: white;
    margin-top: 30px;
    font-weight: 700;
}

center {
    padding-bottom: 60px;
}

.maxx {
    width: 100%;
    /* height: 100vh; */
    /*background: #000;*/
    padding-top: 30px;
    padding-bottom: 40px !important;
    /* margin-top: 30px; */
}

.p6 {
    width: 70%;
    color: white;
    font-size: 22px;
    font-family: 'Roboto', sans-serif;
    font-weight: 600;
    margin-left: 10px;
}

.mini01 {
    width: 100%;
    display: flex;
    justify-content: center;
    margin-top: 120px;
}

.mini01 img {
    width: 30px;
    height: 30px;
}

.bole {
    color: white;
    font-weight: 700;
    font-family: 'Gilroy';
    font-style: normal;
    margin-top: 30px;
}

.halilov {
    width: 100%;
    /* height: 100%; */
    /*background: #000;/*
    padding-top: 70px;
    /* margin-top: 100px; */
}

.mgi {
    width: 80%;
    padding-left: 20px;
    padding-top: 20px;
    min-width: 300px;
    border-radius: 30px;
    background: #3575e4f1;
    color: white;
    margin-top: 20px;
}

.otl {
    width: 90%;
    padding-bottom: 20px;
}

.p001 {
    margin-top: 8px;
    /* width: 1px; */
    font-size: 20px;
    color: rgba(0, 0, 0, 0.15);
    ;
    padding-left: 10px;
    padding-right: 10px;
}

.mgi h3 {
    display: flex;
    align-items: center;
}

.mgi2 {
    width: 70%;
    min-width: 300px;
    /* height: 340px; */
    padding-left: 20px;
    padding-top: 20px;
    border-radius: 30px;
    background: #FC3F1D;
    color: white;
    margin-left: 30px;
    margin-top: 20px;
}

.mxmgi {
    display: flex;
    justify-content: center;
    /* margin-top: 100px; */
    padding-bottom: 20px;
    flex-wrap: wrap;
    /*background: #000;*/
}

.aass {
    display: flex;
}

.aass i {
    margin-top: 5px;
    padding-right: 15px;
}

@media(max-width: 376px) {
    .card {
        width: 80%;
        margin: auto;
        margin-top: 20px;
        /* height: 390px; */
    }

    .p01 {
        margin-top: 10px;
    }

    .h03 {
        font-size: 17px;
    }

    .p02 {
        font-size: 11px;
    }

    .pro {
        font-size: 13 px;
    }

    .h11 {
        font-size: 20px;
    }

    .asd {
        font-size: 18px;
    }

    .mini01 img {
        width: 13px;
        height: 13px;
    }

    hr {
        margin-top: 30px;
    }

    .poch {
        width: 280px;
        font-size: 17px;
    }

    .mgi {
        margin: 0 auto;
    }
}

@media(max-width: 717px) {
    .p6 {
        font-size: 3vw;
    }

    .mini01 {
        margin-top: 7px;
    }

    hr {
        margin-top: 70px;
    }

    .iconka img {
        width: 50px;
    }
}

@media(max-width:458px) {
    .mgi {
        margin: 0 auto;
        width: 80%;
    }

    .mgi2 {
        margin: 0;
        width: 80%;
        height: auto;
        margin-top: 10px;
    }

    .otl {
        font-size: 13px;
    }

    .mgi2 h3,
    .mgi h3 {
        font-size: 17px;
    }


    .pro {
        color: white;
    }

    .iconka {
        display: flex;
        justify-content: center;
    }

    .pasd {
        height: 10px;
        padding-top: 3%;
    }

    .iconka img {
        /* width: 200px; */
        margin-left: 10px;
        margin-top: 10px;
        border-radius: 50%;
        transition: .4s;
    }
}

@media(max-width: 422px) {
    .iconka {
        flex-wrap: wrap;
        margin-top: 10px;
    }
}

.iconka img:hover {
    box-shadow: 0 0 10px white, inset 0 10px 0 white;
    scale: .9;
}

.swiper{
    width: 100%;
    height: 100%;
}

.swiper-slide {
    font-size: 18px;
    /* background: #000; */

    /* Center slide text vertically */
    display: flex;
    justify-content: center;
    align-items: center;
}

.swiper-slide img {
    display: block;
    width: 100%;
    height: 100%;
    object-fit: cover;
}

@media(max-width:1328px) {

    .swiper-slide .mgi,
    .mgi2 {
        width: 200px;
        margin-left: 12%;
        height: 400px;
        font-size: 12px;
    }
}

.swiper {
    width: 100%;
    height: 100%;
}

.swiper-slide {
    /* text-align: center; */
    font-size: 18px;
    /* background: #000; */
    color: white;
    background: url("https://upload.wikimedia.org/wikipedia/commons/3/3c/IMG_logo_%282017%29.svg");
    /* Center slide text vertically */
    display: flex;
    justify-content: center;
    align-items: center;
}

.swiper-slide img {
    display: block;
    width: 100%;
    height: 100%;
    object-fit: cover;
}

.swiper-pagination-bullet-active {
    color: #fff;
    background: #007aff;
}

.mySwiper3 {
    width: 100%;
}

.swiper-wrapper {
    display: flex;
    justify-content: center;
}

.mySwiper2 {
    width: 100%;
    display: none;
}

@media(max-width: 988px) {
    .mySwiper2 {
        width: 100%;
        display: flex;
        margin-left: -15px;
        padding-bottom: 30px;
    }

    .mySwiper {
        width: 100%;
        display: flex;
    }
    .mySwiper0{
        display: none;
    }
    .otl {
        font-size: 12px;
    }
}

.nma {
    color: white;
    font-weight: 700;
    margin-left: 10%;
    margin-top: 110px;
}

.btnla button {
    /* width: 240px; */
    height: 50px;
    padding-left: 20px;
    padding-right: 20px;
    border-radius: 20px;
    font-weight: 700;
    margin-left: 7px;
}

.btnla {
    margin-left: 9%;
    margin-top: 30px;
}

.btnla button:active {
    color: #4047FF;
}

.phon {
    width: 100%;
    margin-top: 30px;
}

.mgi3 {
    margin-top: 340px;
    width: 100%;
    height: 300px;
    background: url("https://upload.wikimedia.org/wikipedia/commons/3/3c/IMG_logo_%282017%29.svg");
}

.mgi img {
    width: 100%;
    height: 200px;
}

.abdurahim {
    width: 630px;
    height: 400px;
    background-image: url("/src/components/image/IMG_5451\ 1.png");
    padding-top: 150px;
}

center .poch,
.qoch {
    color: white;
}

.qoch {
    font-weight: 700;
}

.poch {
    width: 500px;
    font-weight: 700;
}

.bosh {
    display: flex;
    justify-content: center;
    flex-wrap: wrap;
    background: url("./Vector\ 1.png");
    width: 100%;
}

.kalla {
    margin-left: 2%;
}

.pta {
    width: 400px;
    margin-left: 2%;
    background: #fff;
    padding-left: 20px;
    padding-top: 20px;
    padding-bottom: 10px;
    margin-top: 30px;
    border-radius: 20px;
}

.kalla {
    margin-top: 30px;
}

.jadks {
    width: 100%;
    margin-top: 150px;
    margin-left: 10px;
}

.jadks h1 {
    width: 90%;
    font-size: 22px;
}

.mySwiper3 {
    width: 80%;
    display: none;
    justify-content: center;
}

@media(max-width: 1600px) {
    .mySwiper3 {
        display: flex;
        width: 630px;
    }

    .phon .cardcami {
        width: 100%;
        height: 400px;
        /*margin-left: 20%*/
    }

    .cardcami h1 {
        margin-top: 30px;
    }

    
}

@media(max-width: 804px) {
    .mySwiper3 {
        width: 530px;
        height: 300px;
        border-radius: 22px;
    }

    .cardcami h1 {
        padding-top: 100px;
    }

    .mini01 {
        margin-top: 30px;
    }

    .nma {
        font-size: 23px;
    }

    .btnla button {
        width: 100px;
        text-align: center;
        height: 30px;
        padding-right: 120px;
    }
}

@media(max-width: 640px) {
    .abdurahim {
        width: 90%;
        margin-left: 10px;
    }

    .mySwiper3 .abdurahim h3 {
        margin-top: 90px;
    }
}

.cardcami {
    width: 100%;
    height: 200px;
    padding-top: 100px;
    color: white;
    padding-left: 10px;
    background-image: url("/src/components/image/IMG_5451\ 1.png");
}

.cardcami h1 {
    width: 300px;
    font-size: 23px;
}

@media(max-width: 718px) {
    .mySwiper3 {
        width: 630px;
    }
}

@media(max-width: 646px) {
    .mySwiper3 {
        width: 430px;
    }

    .pta {
        width: 100%;
    }

    .btnla button {
        margin-top: 20px;
    }

    .qoch {
        width: 100%;
        font-size: 17px;
    }

    .poch {
        width: 90%;
        font-size: 15px;
    }


    .poch,
    .qoch {
        color: white;
    }
}

@media(max-width: 466px) {
    .mySwiper3 {
        width: 100%;
    }

    .pta {
        width: 100%;
        padding-right: 10px;
    }

    .pta h4 {
        font-size: 16px;
    }

    .pta p {
        width: 100%;
        font-size: 13px;
    }
}

.page-nechi {
    margin-top: 10%;
}

.page-span {
    font-family: 'Gilroy';
    font-style: normal;
    font-weight: 800;
    font-size: 32px;
    line-height: 130%;
    color: #FFFFFF;
}

.page-nechi h1 {
    font-family: 'Gilroy';
    font-style: normal;
    font-weight: 800;
    font-size: 32px;
    line-height: 130%;
    color: #FFFFFF;
}

.necicard {
    display: flex;
    justify-content: space-around;
    align-items: center;
    width: 70%;
    margin: 0 auto;
    flex-wrap: wrap;
}

.ant {
    display: flex;
    background: #fff;
    padding: 20px;
    margin-top: 20px;
    border-radius: 20px;
}

.anm h3 {
    font-size: 23px;
    font-weight: 700;
    color: black;
}

.anm {
    margin-top: 10px;
}

.anm p {
    color: #949494;
}

.ant img {
    margin-left: 20px;
    align-items: center;
}

@media(max-width: 334px) {
    .page-span {
        font-size: 20px;
    }

    .page-nechi center h1 {
        font-size: 20px;
    }
}

@media(max-width: 536px) {
    .anm h3 {
        font-size: 17px;
    }

    .anm p {
        font-size: 13px;
    }

    .ant img {
        width: 70px;
    }
}

@media(max-width: 410px) {
    .ant {
        width: 80%;
    }

    .necicard {
        width: 100%;
    }

    .anm h3 {
        font-size: 13px;
    }

    .mip img {
        width: 100%;
    }
}
@media(max-width: 790px){
    .phon .abdurahim{
        width: 540px;
        height: 200px;
        margin-left: 5px;
        border-radius: 20px;
    }
    .jadks{
        margin-top: -60px;
        text-shadow: 0 0 10px black;
    }
}
</style>
<script>
// Import Swiper Vue.js components
import { Swiper, SwiperSlide } from 'swiper/vue';

// Import Swiper styles
import 'swiper/css';

import 'swiper/css/navigation';

import '../assets/main.css';

// import required modules
import { Navigation } from 'swiper';

export default {
    components: {
        Swiper,
        SwiperSlide,
    },
    setup() {
        return {
            modules: [Navigation],
        };
    },
};
</script>
